zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_gc01/atdf/PIC32CK1012GC01100.atdf
      <register-group name="HMATRIX2" caption="HSB Matrix">
        <register name="MCFG" offset="0x0" rw="RW" size="4" access-size="4" count="16" initval="0x00000002" caption="Master Configuration">
          <bitfield name="ULBT" caption="Undefined Length Burst Type" mask="0x7" values="MCFG__ULBT"/>
        </register>
        <register name="SCFG" offset="0x40" rw="RW" size="4" access-size="4" count="13" initval="0x00000010" caption="Slave Configuration">
          <bitfield name="SLOT_CYCLE" caption="Maximum Number of Allowed Cycles for a Burst" mask="0x1FF"/>
          <bitfield name="DEFMSTR_TYPE" caption="Default Master Type" mask="0x30000" values="SCFG__DEFMSTR_TYPE"/>
          <bitfield name="FIXED_DEFMSTR" caption="Fixed Index of Default Master" mask="0x3C0000"/>
        </register>
        <register-group name="PRS" name-in-module="PRS" offset="0x080" size="0x8" count="13"/>
        <register name="MRCR" offset="0x100" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Master Remap Control">
          <bitfield name="RCB0" caption="Remap Command Bit for Master 0" mask="0x1" values="MRCR__RCB"/>
          <bitfield name="RCB1" caption="Remap Command Bit for Master 1" mask="0x2" values="MRCR__RCB"/>
          <bitfield name="RCB2" caption="Remap Command Bit for Master 2" mask="0x4" values="MRCR__RCB"/>
          <bitfield name="RCB3" caption="Remap Command Bit for Master 3" mask="0x8" values="MRCR__RCB"/>
          <bitfield name="RCB4" caption="Remap Command Bit for Master 4" mask="0x10" values="MRCR__RCB"/>
          <bitfield name="RCB5" caption="Remap Command Bit for Master 5" mask="0x20" values="MRCR__RCB"/>
          <bitfield name="RCB6" caption="Remap Command Bit for Master 6" mask="0x40" values="MRCR__RCB"/>
          <bitfield name="RCB7" caption="Remap Command Bit for Master 7" mask="0x80" values="MRCR__RCB"/>
          <bitfield name="RCB8" caption="Remap Command Bit for Master 8" mask="0x100" values="MRCR__RCB"/>
          <bitfield name="RCB9" caption="Remap Command Bit for Master 9" mask="0x200" values="MRCR__RCB"/>
          <bitfield name="RCB10" caption="Remap Command Bit for Master 10" mask="0x400" values="MRCR__RCB"/>
          <bitfield name="RCB11" caption="Remap Command Bit for Master 11" mask="0x800" values="MRCR__RCB"/>
          <bitfield name="RCB12" caption="Remap Command Bit for Master 12" mask="0x1000" values="MRCR__RCB"/>
          <bitfield name="RCB13" caption="Remap Command Bit for Master 13" mask="0x2000" values="MRCR__RCB"/>
          <bitfield name="RCB14" caption="Remap Command Bit for Master 14" mask="0x4000" values="MRCR__RCB"/>
          <bitfield name="RCB15" caption="Remap Command Bit for Master 15" mask="0x8000" values="MRCR__RCB"/>
        </register>
        <register name="SFR" offset="0x110" rw="RW" size="4" access-size="4" count="13" initval="0x00000000" caption="Special Function">
          <bitfield name="SFR" caption="Special Function Register" mask="0xFFFFFFFF"/>
        </register>
        <register name="MEIER" offset="0x150" rw="W" size="4" access-size="4" atomic-op="set:MEIMR" caption="Master Error Interrupt Enable">
          <bitfield name="MERR0" caption="Master 0 Access Error" mask="0x1"/>
          <bitfield name="MERR1" caption="Master 1 Access Error" mask="0x2"/>
          <bitfield name="MERR2" caption="Master 2 Access Error" mask="0x4"/>
          <bitfield name="MERR3" caption="Master 3 Access Error" mask="0x8"/>
          <bitfield name="MERR4" caption="Master 4 Access Error" mask="0x10"/>
          <bitfield name="MERR5" caption="Master 5 Access Error" mask="0x20"/>
          <bitfield name="MERR6" caption="Master 6 Access Error" mask="0x40"/>
          <bitfield name="MERR7" caption="Master 7 Access Error" mask="0x80"/>
          <bitfield name="MERR8" caption="Master 8 Access Error" mask="0x100"/>
          <bitfield name="MERR9" caption="Master 9 Access Error" mask="0x200"/>
          <bitfield name="MERR10" caption="Master 10 Access Error" mask="0x400"/>
          <bitfield name="MERR11" caption="Master 11 Access Error" mask="0x800"/>
          <bitfield name="MERR12" caption="Master 12 Access Error" mask="0x1000"/>
          <bitfield name="MERR13" caption="Master 13 Access Error" mask="0x2000"/>
          <bitfield name="MERR14" caption="Master 14 Access Error" mask="0x4000"/>
          <bitfield name="MERR15" caption="Master 15 Access Error" mask="0x8000"/>
        </register>
        <register name="MEIDR" offset="0x154" rw="W" size="4" access-size="4" atomic-op="clear:MEIMR" caption="Master Error Interrupt Disable">
          <bitfield name="MERR0" caption="Master 0 Access Error" mask="0x1"/>
          <bitfield name="MERR1" caption="Master 1 Access Error" mask="0x2"/>
          <bitfield name="MERR2" caption="Master 2 Access Error" mask="0x4"/>
          <bitfield name="MERR3" caption="Master 3 Access Error" mask="0x8"/>
          <bitfield name="MERR4" caption="Master 4 Access Error" mask="0x10"/>
          <bitfield name="MERR5" caption="Master 5 Access Error" mask="0x20"/>
          <bitfield name="MERR6" caption="Master 6 Access Error" mask="0x40"/>
          <bitfield name="MERR7" caption="Master 7 Access Error" mask="0x80"/>
          <bitfield name="MERR8" caption="Master 8 Access Error" mask="0x100"/>
          <bitfield name="MERR9" caption="Master 9 Access Error" mask="0x200"/>
          <bitfield name="MERR10" caption="Master 10 Access Error" mask="0x400"/>
          <bitfield name="MERR11" caption="Master 11 Access Error" mask="0x800"/>
          <bitfield name="MERR12" caption="Master 12 Access Error" mask="0x1000"/>
          <bitfield name="MERR13" caption="Master 13 Access Error" mask="0x2000"/>
          <bitfield name="MERR14" caption="Master 14 Access Error" mask="0x4000"/>
          <bitfield name="MERR15" caption="Master 15 Access Error" mask="0x8000"/>
        </register>
        <register name="MEIMR" offset="0x158" rw="R" size="4" access-size="4" caption="Master Error Interrupt Mask">
          <bitfield name="MERR0" caption="Master 0 Access Error" mask="0x1"/>
          <bitfield name="MERR1" caption="Master 1 Access Error" mask="0x2"/>
          <bitfield name="MERR2" caption="Master 2 Access Error" mask="0x4"/>
          <bitfield name="MERR3" caption="Master 3 Access Error" mask="0x8"/>
          <bitfield name="MERR4" caption="Master 4 Access Error" mask="0x10"/>
          <bitfield name="MERR5" caption="Master 5 Access Error" mask="0x20"/>
          <bitfield name="MERR6" caption="Master 6 Access Error" mask="0x40"/>
          <bitfield name="MERR7" caption="Master 7 Access Error" mask="0x80"/>
          <bitfield name="MERR8" caption="Master 8 Access Error" mask="0x100"/>
          <bitfield name="MERR9" caption="Master 9 Access Error" mask="0x200"/>
          <bitfield name="MERR10" caption="Master 10 Access Error" mask="0x400"/>
          <bitfield name="MERR11" caption="Master 11 Access Error" mask="0x800"/>
          <bitfield name="MERR12" caption="Master 12 Access Error" mask="0x1000"/>
          <bitfield name="MERR13" caption="Master 13 Access Error" mask="0x2000"/>
          <bitfield name="MERR14" caption="Master 14 Access Error" mask="0x4000"/>
          <bitfield name="MERR15" caption="Master 15 Access Error" mask="0x8000"/>
        </register>
        <register name="MESR" offset="0x15C" rw="R" size="4" access-size="4" atomic-op="clear:MESR" caption="Master Error Status">
          <bitfield name="MERR0" caption="Master 0 Access Error" mask="0x1"/>
          <bitfield name="MERR1" caption="Master 1 Access Error" mask="0x2"/>
          <bitfield name="MERR2" caption="Master 2 Access Error" mask="0x4"/>
          <bitfield name="MERR3" caption="Master 3 Access Error" mask="0x8"/>
          <bitfield name="MERR4" caption="Master 4 Access Error" mask="0x10"/>
          <bitfield name="MERR5" caption="Master 5 Access Error" mask="0x20"/>
          <bitfield name="MERR6" caption="Master 6 Access Error" mask="0x40"/>
          <bitfield name="MERR7" caption="Master 7 Access Error" mask="0x80"/>
          <bitfield name="MERR8" caption="Master 8 Access Error" mask="0x100"/>
          <bitfield name="MERR9" caption="Master 9 Access Error" mask="0x200"/>
          <bitfield name="MERR10" caption="Master 10 Access Error" mask="0x400"/>
          <bitfield name="MERR11" caption="Master 11 Access Error" mask="0x800"/>
          <bitfield name="MERR12" caption="Master 12 Access Error" mask="0x1000"/>
          <bitfield name="MERR13" caption="Master 13 Access Error" mask="0x2000"/>
          <bitfield name="MERR14" caption="Master 14 Access Error" mask="0x4000"/>
          <bitfield name="MERR15" caption="Master 15 Access Error" mask="0x8000"/>
        </register>
        <register name="MEAR" offset="0x160" rw="R" size="4" access-size="4" count="16" caption="Master Error Address">
        </register>
      </register-group>
      <value-group name="MCFG__ULBT">
        <value name="INFINITE" caption="Infinite Length" value="0"/>
        <value name="SINGLE" caption="Single Access" value="1"/>
        <value name="FOUR_BEAT" caption="Four Beat Burst" value="2"/>
        <value name="EIGHT_BEAT" caption="Eight Beat Burst" value="3"/>
        <value name="SIXTEEN_BEAT" caption="Sixteen Beat Burst" value="4"/>
      </value-group>
      <value-group name="SCFG__DEFMSTR_TYPE">
        <value name="NO_DEFAULT" caption="No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst." value="0"/>
        <value name="LAST_DEFAULT" caption="Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave." value="1"/>
        <value name="FIXED_DEFAULT" caption="Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave." value="2"/>
      </value-group>
      <value-group name="MRCR__RCB">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
    </module>
    <module name="ICB" id="SYSTEM_IP" version="1.0.0" caption="Implementation Control Block">
      <register-group name="ICB" caption="Implementation Control Block">
        <register name="ICTR" offset="0x4" rw="R" size="4" access-size="4" caption="Interrupt Controller Type Register">
          <bitfield name="INTLINESNUM" caption="Interrupt line set number" mask="0xF"/>
        </register>
        <register name="ACTLR" offset="0x8" rw="RW" size="4" access-size="4" caption="Auxiliary Control Register">
        </register>
        <register name="CPPWR" offset="0xC" rw="RW" size="4" access-size="4" caption="Coprocessor Power Control Register">
          <bitfield name="SU0" caption="State UNKNOWN 0" mask="0x1"/>
          <bitfield name="SUS0" caption="State UNKNOWN Secure only 0" mask="0x2"/>
          <bitfield name="SU1" caption="State UNKNOWN 1" mask="0x4"/>
          <bitfield name="SUS1" caption="State UNKNOWN Secure only 1" mask="0x8"/>
          <bitfield name="SU2" caption="State UNKNOWN 2" mask="0x10"/>
          <bitfield name="SUS2" caption="State UNKNOWN Secure only 2" mask="0x20"/>
          <bitfield name="SU3" caption="State UNKNOWN 3" mask="0x40"/>
          <bitfield name="SUS3" caption="State UNKNOWN Secure only 3" mask="0x80"/>
          <bitfield name="SU4" caption="State UNKNOWN 4" mask="0x100"/>
          <bitfield name="SUS4" caption="State UNKNOWN Secure only 4" mask="0x200"/>
          <bitfield name="SU5" caption="State UNKNOWN 5" mask="0x400"/>
          <bitfield name="SUS5" caption="State UNKNOWN Secure only 5" mask="0x800"/>
          <bitfield name="SU6" caption="State UNKNOWN 6" mask="0x1000"/>
          <bitfield name="SUS6" caption="State UNKNOWN Secure only 6" mask="0x2000"/>
          <bitfield name="SU7" caption="State UNKNOWN 7" mask="0x4000"/>
          <bitfield name="SUS7" caption="State UNKNOWN Secure only 7" mask="0x8000"/>
          <bitfield name="SU10" caption="State UNKNOWN 10" mask="0x100000"/>
          <bitfield name="SUS10" caption="State UNKNOWN Secure only 10" mask="0x200000"/>
          <bitfield name="SU11" caption="State UNKNOWN 11" mask="0x400000"/>
          <bitfield name="SUS11" caption="State UNKNOWN Secure only 11" mask="0x800000"/>
        </register>
      </register-group>
    </module>
    <module name="IDAU" id="04250" name2="sec_idau_v3" version="3a0" caption="Implementation Defined Attribution Unit">
      <register-group name="REGIONS" size="0x10">
        <register name="RCTRL" offset="0x0" rw="W" size="4" initval="0x00000000" caption="Region Control">
          <mode name="BLOCK" caption="Block Based Region"/>
          <mode name="WATERMARK" caption="Watermark Based Region"/>
          <bitfield modes="BLOCK" name="ARG" caption="Command Argument (Block ID)" mask="0x1F"/>
          <bitfield modes="WATERMARK" name="ARG" caption="Command Argument (Watermark)" mask="0xFFFFFF"/>
          <bitfield modes="BLOCK" name="CMD" caption="Command" mask="0xFF000000" values="RCTRL_BLOCK__CMD"/>
          <bitfield modes="WATERMARK" name="CMD" caption="Command" mask="0xFF000000" values="RCTRL_WATERMARK__CMD"/>
        </register>
        <register name="RSTATUSA" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Region Status A">
          <bitfield name="TYPE" caption="IDAU Region Type" mask="0xF" values="RSTATUSA__TYPE"/>
          <bitfield name="GRAN" caption="Region Granularity" mask="0x3F00" values="RSTATUSA__GRAN"/>
          <bitfield name="MAXSZ" caption="Command Argument Maximum Size" mask="0x3F0000"/>
        </register>
        <register name="RSTATUSB" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Region Status B">
          <mode name="BLOCK" caption="Block Based Region"/>
          <mode name="WATERMARK" caption="Watermark Based Region"/>
          <bitfield modes="BLOCK" name="NONSEC" caption="Block Based Region Non-Secure State" mask="0xFFFFFFFF"/>
          <bitfield modes="WATERMARK" name="SIZE" caption="Watermark Based Region Size in Bytes" mask="0xFFFFFFFF"/>
        </register>
        <register name="RSTATUSC" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Region Status C">
          <mode name="BLOCK"/>
          <mode name="LINK"/>
          <bitfield modes="LINK" name="RGN" caption="Linked IDAU Region ID" mask="0xFF"/>
          <bitfield modes="LINK" name="BLK" caption="Linked IDAU Region Block ID" mask="0x1F00"/>
          <bitfield modes="BLOCK" name="CST" caption="Constant Block Configuration" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <register-group name="IDAU" caption="Implementation Defined Attribution Unit">
        <register name="CTRL" offset="0x0" rw="W" size="4" initval="0x00000000" caption="Control">
          <bitfield name="CMD" caption="Command Register" mask="0xFFFF0000" values="CTRL__CMD"/>
        </register>
        <register name="STATUSA" offset="0x4" rw="R" size="4" caption="Status A">
          <bitfield name="ENABLE" caption="Enable" mask="0x1"/>
          <bitfield name="WLCK" caption="Write Lock" mask="0x2"/>
          <bitfield name="NBRG" caption="Number Of IDAU Regions" mask="0x1FF00"/>
        </register>
        <register name="STATUSB" offset="0x8" rw="RW" size="4" atomic-op="clear:STATUSB" initval="0x00000000" caption="Status B">
          <bitfield name="CFGERR" caption="Configuration Error" mask="0x1"/>
        </register>
        <register-group name="REGIONS" name-in-module="REGIONS" offset="0x1000" size="0x10" count="24"/>
      </register-group>
      <value-group name="RCTRL_BLOCK__CMD">
        <value name="CLRNONSEC" caption="Clear IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=0)" value="0x5A"/>
        <value name="SETNONSEC" caption="Set IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=1)" value="0x5B"/>
      </value-group>
      <value-group name="RCTRL_WATERMARK__CMD">
        <value name="WRSZ" caption="Write IDAU region x Size (RSTATUSB[x].SIZE=ARG)" value="0x5C"/>
      </value-group>
